       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello5.
       AUTHOR. Leocrabe225.
       DATE-WRITTEN. 29-04-2025 (fr).
       DATE-COMPILED. null.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           PERFORM 5 TIMES
               DISPLAY "Bonjour"
           END-PERFORM.
           STOP RUN.
