       01  :PREFIX:-RETURN-VALUE    PIC 9(02).
      * RETURN OK
           88 :PREFIX:-RETURN-OK              VALUE 00.
      * ID ERRORS
           88 :PREFIX:-RETURN-ID-FORMAT-ERROR VALUE 10.
      * EMAIL ERRORS
           88 :PREFIX:-RETURN-EMAIL-NO-AT     VALUE 20.
           88 :PREFIX:-RETURN-EMAIL-MANY-AT   VALUE 21.
           88 :PREFIX:-RETURN-EMAIL-NO-DOT    VALUE 22.
