       IDENTIFICATION DIVISION.
       PROGRAM-ID. filest.
       AUTHOR. Leocrabe225.
       DATE-WRITTEN. 23-04-2025 (fr)
       DATE-COMPILED. null.
       ENVIRONMENT DIVISION.
           INPUT-OUTPUT.
               FILE-CONTROL.
       DATA DIVISION.
       01 DATA-TEST 
       PROCEDURE DIVISION.
           OPEN INPUT "test".
           READ "test" INTO 
       
    