       01 WS-EOF              PIC 9(01).
           88 WS-EOF-TRUE               VALUE 1.
           88 WS-EOF-FALSE              VALUE 0.
           