       IDENTIFICATION DIVISION.
       PROGRAM-ID. master.
       AUTHOR. Leocrabe225.
       DATE-WRITTEN. 12-06-2025 (fr).

       DATA DIVISION.

       PROCEDURE DIVISION.

           DISPLAY "Terry est très joli".

           CALL "subprog".

           STOP RUN.
