       IDENTIFICATION DIVISION.
       PROGRAM-ID. subprog.
       AUTHOR. Leocrabe225.
       DATE-WRITTEN. 12-06-2025 (fr).

       DATA DIVISION.

       PROCEDURE DIVISION.

           DISPLAY "This is a subprog".

           STOP RUN.
