       01 :TAG:-STUDENTS-RECORD.
           05 :TAG:-CLASS-NAME         PIC X(03).
           05 :TAG:-FILLER             PIC X(03).
           05 :TAG:-STUDENT-FULL-NAME.
               10 :TAG:-STUDENT-NAME   PIC X(08).
               10 :TAG:-FILLER         PIC X(03).
               10 :TAG:-STUDENT-FNAME  PIC X(08).
               